app/views/users/_form.html.slim

SELECT "careers".* FROM "careers"
---
  == f.form_group :career_code do
    == f.select :career_id, options_from_collection_for_select(Career.all, :id, :name)