app/controllers/careers_controller.rb

  def index
    @careers = Career.all
    @upload = Upload.new
    @uploads = Upload.all
---
SELECT "careers".* FROM "careers"
SELECT "uploads".* FROM "uploads"