app/controllers/uploads_controller.rb

INSERT INTO "uploads" ("attachment", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["attachment", "SM_chapter1.pdf"], ["created_at", "2014-07-16 22:05:28.412080"], ["name", "fkf"], ["updated_at", "2014-07-16 22:05:28.412080"]]
---
  def create
   @uploads = []
    if params[:upload]
      params[:upload][:files].each {|file| @uploads.push(Upload.new(attachment: file))}

SELECT  "uploads".* FROM "uploads"  WHERE "uploads"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "uploads" WHERE "uploads"."id" = ?  [["id", 1]]
---
  def destroy
    @upload = Upload.find(params[:id])
    @upload.destroy