app/controllers/users_controller.rb

  def create
  	@user = Student.new(user_params)

    if @user.save
---
INSERT INTO "users" ("career_code", "created_at", "email", "extra_credits", "first_name", "last_name", "password_digest", "remember_token", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)